app/Http/Controllers/Cox_ContentController.php

    public function cox_content()
    {
        // Ambil data dari tabel cox_content
        $coxcontent = Cox_Content::all();
---
SELECT * FROM `cox_contents`

    public function show($id)
    {
        // mencari data dari tabel cox_content
        $coxcontent = Cox_Content::find($id);
---
SELECT * FROM `cox_contents` WHERE `cox_contents`.`id` = '1' LIMIT 1